<template>
<!-- <v-card height="1000" width="1000" align="left"> -->
<div height="1000" width="300" align="left">
    <h3>{{little_titles[0].text}}</h3>
    <h4>{{content[selected_idx]}}</h4>
    <h3>{{little_titles[1].text}}</h3>
    <h4>{{content[selected_idx]}}</h4>
    <h3>{{little_titles[2].text}}</h3>
    <h4>{{content[selected_idx]}}</h4>
    <h3>{{little_titles[3].text}}</h3>
    {{selected_idx,}}
</div>
</template>

<script>
export default {
    name: 'projContent',
    data: () => ({
        contents_like: 0,
        title: '캡스톤 디자인 프로젝트 기획 보고서 작성하기',
        date: '2020.10.12 05:55',
        writer: ['김김김', '이이이', '박박박'],
        little_titles: [{
                idx: 1,
                text: '기획보고서란'
            },
            {
                idx: 2,
                text: '유사 제품 서비스 동향'
            },
            {
                idx: 3,
                text: '관련 기술 동향'
            },
            {
                idx: 4,
                text: '유저 스토리'
            },
            {
                idx: 5,
                text: 'UX/UI 설계'
            },
            {
                idx: 6,
                text: '시스템 설계'
            },
            {
                idx: 7,
                text: '청춘예찬'
            },
            {
                idx: 8,
                text: '별헤는밤'
            },

        ],
        selected_idx: 0,
        content: [
            '동산에는 우리 온갖 풀이 우리의 싶이 하였으며, 뿐이다. 이상, 귀는 그들에게 사랑의 용기가 만천하의 미묘한 것이다. 할지니, 수 듣기만 있는 할지라도 커다란 피다. 인간이 인간은 오직 그들의 만물은 찾아다녀도, 청춘의 것은 것이다. 우리의 가장 얼음에 넣는 없는 싸인 사막이다. 그러므로 살 청춘의 것이 꽃이 들어 칼이다. 자신과 피고, 대중을 청춘이 크고 이는 것이다. 귀는 타오르고 끝에 얼마나 교향악이다. 열매를 능히 노래하며 무엇을 품으며, 쓸쓸하랴?',
            '꽃이 얼마나 고동을 우리의 천자만홍이 위하여 보라. 장식하는 피가 오아이스도 부패뿐이다. 스며들어 넣는 가치를 온갖 같지 청춘 뭇 천고에 따뜻한 운다. 할지니, 못할 살았으며, 이것을 피가 있으며, 긴지라 사는가 몸이 아니다.',
            '산야에 없으면 아니더면, 철환하였는가? 없으면, 긴지라 그들은 위하여서 군영과 인생에 천하를 봄바람이다. 놀이 동산에는 끓는 광야에서 때문이다. 피에 같은 따뜻한 별과 보이는 이상 사막이다. 피고 위하여서, 주며, 실로 굳세게 오직 들어 것이다. 실로 같이, 곧 뿐이다. 생명을 없으면, 목숨을 만천하의 실현에 안고, 우리는 싹이 물방아 끓는다. 기관과 많이 그것은 가치를 무한한 낙원을 인간이 운다. 석가는 없으면 이상은 보는 싶이 같은 열락의 동력은 영락과 아름다우냐?',
            '이런 새워 위에도 어머니, 쓸쓸함과 아침이 별빛이 책상을 계십니다. 않은 피어나듯이 사랑과 슬퍼하는 까닭입니다. 별 어머님, 별 이름과, 사람들의 자랑처럼 내 까닭입니다. 이름과, 그리워 계절이 시인의 까닭이요, 나는 하나의 위에 시와 듯합니다. 그러나 차 멀리 이름자를 별 슬퍼하는 별 북간도에 있습니다. 노새, 하나에 된 봅니다. 하나에 한 이름과 아이들의 하나의 이국 무엇인지 이름을 했던 봅니다. 쓸쓸함과 아름다운 자랑처럼 마디씩 풀이 봅니다. 아직 우는 별이 쉬이 묻힌 봅니다. 별에도 노루, 멀리 계십니다. 없이 멀리 계집애들의 있습니다.',
            '계집애들의 이국 딴은 슬퍼하는 하나에 계십니다. 쉬이 북간도에 우는 당신은 거외다. 위에도 겨울이 둘 때 우는 나는 별에도 있습니다. 이네들은 다 계절이 아직 지나가는 한 내린 책상을 봅니다. 아직 이웃 별 별 시인의 쓸쓸함과 어머님, 까닭입니다. 멀리 이름자를 계절이 지나가는 당신은 하나에 계십니다. 딴은 겨울이 별 까닭입니다. 파란 지나가는 것은 헤는 버리었습니다. 하나 추억과 헤는 하나에 가을 계십니다.',
            '별들을 너무나 어머니, 그러나 내린 헤일 봅니다. 경, 자랑처럼 아직 있습니다. 피어나듯이 시인의 자랑처럼 계절이 이름을 이웃 지나고 멀듯이, 거외다. 아름다운 별 불러 밤이 된 무엇인지 별들을 가슴속에 위에 있습니다. 쉬이 하나에 속의 별 별빛이 무덤 슬퍼하는 이름자 계십니다. 너무나 가을 멀듯이, 나는 자랑처럼 시인의 별 라이너 까닭입니다. 까닭이요, 마디씩 헤는 남은 비둘기, 버리었습니다. 위에 별을 하나에 잔디가 하나에 이웃 가을로 밤을 듯합니다. 이름자 책상을 내 이름과 옥 이웃 가난한 듯합니다. 아스라히 무성할 못 릴케 둘 별 이름과, 버리었습니다.',
            '새워 하나 덮어 별 거외다. 가을 라이너 그러나 파란 책상을 이름자를 말 별 계십니다. 다하지 이름자 이름과, 헤는 사람들의 이름을 거외다. 소학교 추억과 별 계십니다. 이름과, 다하지 사랑과 계십니다. 새워 그리고 위에도 사람들의 책상을 있습니다. 피어나듯이 없이 까닭이요, 비둘기, 지나가는 무덤 있습니다. 시와 내 한 헤는 당신은 마리아 아침이 많은 노새, 거외다. 덮어 이국 강아지, 별 밤을 소학교 경, 있습니다.',
            '묻힌 하나에 언덕 불러 나의 하나의 별을 듯합니다. 하늘에는 된 이름과, 나의 말 봅니다. 하나에 이름자 이제 지나가는 별 것은 별이 많은 계십니다. 봄이 가난한 패, 하나 아이들의 멀리 내린 거외다. 못 어머니, 별 내린 별에도 쉬이 다 하나에 패, 봅니다. 북간도에 청춘이 써 가을로 묻힌 이름을 계십니다. 까닭이요, 풀이 헤일 부끄러운 하나에 듯합니다. 소녀들의 아름다운 하나 내일 오는 토끼, 멀리 묻힌 이름자 거외다. 경, 다하지 새워 둘 밤이 이름과, 거외다. 무덤 덮어 이름을 했던 내 라이너 이런 언덕 계십니다. 동경과 오는 걱정도 슬퍼하는 있습니다.'
        ],

    }),
    methods: {
        increment() {
            // 인스턴스 내부의 데이터모델에 접근 할 땐,
            // this 를 사용한다
            this.contents_like++;
        },
        decrement() {
            this.contents_like--;
        }
    }
}
</script>
